---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.SpecifyCoordinatesAtPoint
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.SpecifyCoordinatesAtPoint

Relocates a model and rotates the model to True North by specifying coordinates for North/South, East/West, and Elevation.